

//функция закрывающая уровень в зависимости от результатов игрока
fun gameOver(win: String, message: String, ){
    when (win){
        "true" -> {
            println("======================================================================================================================")
            println("                      --------< УРОВЕНЬ ПРОЙДЕН $message >-------- ")
            println("======================================================================================================================")
        }
        "false" -> {
            println("======================================================================================================================")
            println("                       --------< GAME OVER $message >--------  ")
            println("======================================================================================================================")

        }
        else if (win == "==" && message == "==")-> {
            println("======================================================================================================================")
        }
        else if (win == "Go" && message == "Go")->{
            println("                    --------< $gameNumber,$gameHour,$gameDay >-------- ")
        }
        else -> {

            println("                    --------< $message >--------")}

    }
}

fun сonsentVerification(){
    do {
        print("---> ")
        val ready = readlnOrNull()?.trim() ?: ""
        if (ready.equals("yes", ignoreCase = true)) break

        println("Ты ввел полную хуйню, димон очень расстроен и недоволен," +
                " ходи оглядывайся или все-таки попытайся ввести похожее на сonsentVerification")
    }
    while (true)
}

fun time(threadSleep: Int){
    Thread.sleep(threadSleep.toLong())
}

fun clearConsole(){
    repeat(50){ println()}

}